Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ShearAreaWeakAxis
Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ShearAreaStrongAxis
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.WarpingConstant
Warping constant (Cw, Iomega, H)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.TorsionalModulus
Section modulus for calculations of torsion stresses (Ct)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.TorsionalMomentOfInertia
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.PlasticModulusWeakAxis
Plastic section modulus in bending about main weak axis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.PlasticModulusStrongAxis
Plastic section modulus in bending about main strong axis (Z, Wpl)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ElasticModulusWeakAxis
Elastic section modulus about main weak axis for calculation of bending stresses.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.ElasticModulusStrongAxis
Elastic section modulus about main strong axis for calculation of bending stresses.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.MomentOfInertiaWeakAxis
Moment of Inertia about main weak axis (I).
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.MomentOfInertiaStrongAxis
Moment of Inertia about main strong axis (I).
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.NominalWeight
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.Perimeter
Painting surface of the unit length.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.SectionArea
Cross section area.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.PrincipalAxesAngle
Rotation angle between the principal axes and cross section reference planes.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a new instance of StructuralSectionAnalysisParams.
principalAxesAngle:
Rotation angle between the principal axes and cross section reference planes.
sectionArea:
Cross section area.
perimeter:
Painting surface of the unit length.
nominalWeight:
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis:
Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis:
Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis:
Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis:
Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis:
Plastic section modulus in bending about main strong axis (Z, Wpl)
plasticModulusWeakAxis:
Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia:
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
torsionalModulus:
Section modulus for calculations of torsion stresses (Ct)
warpingConstant:
Warping constant (Cw, Iomega, H)
shearAreaStrongAxis:
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis:
Shear area (reduced extreme shear stress coefficient) in the direction of
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.#ctor
Creates a new instance of StructuralSectionAnalysisParams.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
Defines common set of parameters for structural analysis.
Since:
2018